active_records_and_action_pack/todolists/app/controllers/todo_items_controller.rb

  def index
    @todo_items = @todo_list.todo_items.all
    @n_completed_todo_items = @todo_items.all.where(completed: true).count()
---
SELECT "todo_items".* FROM "todo_items"  ORDER BY due_date asc
SELECT SUM(false) FROM "todo_items"
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."completed" = ?  [["completed", "t"]]

  def create
    @todo_item = @todo_list.todo_items.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save
---
INSERT INTO "todo_items" ("title", "description", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Random"], ["description", ""], ["due_date", "2018-04-07"], ["created_at", "2018-04-08 04:12:58.591818"], ["updated_at", "2018-04-08 04:12:58.591818"]]

  def update
    respond_to do |format|
      if @todo_item.update(todo_item_params)
---
UPDATE "todo_items" SET "title" = ?, "description" = ?, "due_date" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["title", "first todo list"], ["description", "changed form partial"], ["due_date", "2019-04-08"], ["updated_at", "2018-04-08 03:40:29.421166"], ["id", 4]]

  def destroy
    @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 3]]

    def set_todo_item
      @todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ?  ORDER BY due_date asc LIMIT 1  [["id", 3]]