active_records_and_action_pack/todolists/app/views/todo_items/index.html.erb

  <tbody>
    <% @todo_list.todo_items.each do |todo_item| %>
---
SELECT "todo_items".* FROM "todo_items"  ORDER BY due_date asc
SELECT SUM(false) FROM "todo_items"